app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `help_url`) VALUES('WED Zip Site', '2009-05-27 19:47:35', '2009-05-27 19:47:35', 'http://www.bigfolio.com/help')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save