app/controllers/clients_controller.rb

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`name`, `created_at`, `business`, `database_name`, `web_user`, `admin_password`, `signup_date`, `updated_at`, `domain`, `server`, `admin_user`, `template`, `database_user`, `web_password`, `database_password`, `monthly_fee`, `billing_date`, `email`, `active`) VALUES('Dee Bag', '2009-05-27 20:08:22', 'Dee Bag Foto', 'dharm_debbie', 'dharm', '999', '2009-05-27', '2009-05-27 20:08:22', 'dbagfoto.com', '72.32.68.101 (RS 6)', 'debharmon@fairpoint.net', 'York', 'dharm', '123', '123', 25.0, '2009-05-27', 'foo@bar.com', NULL)