app/controllers/faqs_controller.rb

  def show
    @faq = Faq.find(params[:id])
---
SELECT * FROM `faqs` WHERE (`faqs`.`id` = 1)

  def create
    @faq = Faq.new(params[:faq])

    respond_to do |format|
      if @faq.save
---
INSERT INTO `faqs` (`created_at`, `title`, `body`, `updated_at`, `category_id`) VALUES('2009-02-18 19:25:21', 'Why does my NextProof store cause a security warning?', 'If you have mapped your NextProof account to a domain (like store.example.com), the certificate on our server will no longer match the domain. When this happens, some browsers may emit a security warning to your visitors. \r\n\r\nThis can be remedied by installing a certificate that matches your mapped domain.\r\n\r\nIf you want to do this, submit a support ticket requesting a CSR (certificate signing request). We will generate a CSR which you will need to purchase your certificate. \r\n\r\nYou can purchase a certificate from GoDaddy or InstantSSL.', '2009-02-18 19:25:21', 2)