app/controllers/help_controller.rb

SELECT * FROM `faqs` WHERE (category_id = '1')
---
  def faqs
    @faqs = Faq.find(:all, :conditions => ['category_id = ?', params[:id]])

SELECT * FROM `tickets` WHERE (`tickets`.`key` = '3') LIMIT 1
---
  def view_by_key
    @ticket = Ticket.find_by_key(params[:key])

SELECT * FROM `tickets` WHERE (`tickets`.`key` = 'afdjsjklfsdajk') LIMIT 1
---
  def search_by_key
    @ticket = Ticket.find_by_key(params[:key])