app/controllers/messages_controller.rb

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
INSERT INTO `messages` (`attachment_file_name`, `attachment_content_type`, `attachment_file_size`, `created_at`, `body`, `attachment_uploaded_at`, `updated_at`, `ticket_id`, `user_id`, `attachment_updated_at`) VALUES('entry_kids.jpg', 'image/jpeg', 39237, '2009-02-18 21:44:51', 'This is a test message ... ', NULL, '2009-02-18 21:44:51', NULL, 1, '2009-02-18 21:44:51')
---
  def create

    @ticket = Ticket.find(params[:ticket_id])
    @message = @ticket.messages.build(params[:message])
    @message.user = current_user
    respond_to do |format|
      if @message.save