app/controllers/tickets_controller.rb

SELECT * FROM `tickets` WHERE ((name like '%live%' or email like '%live%' or domain like '%live%' or subject like '%live%'))
---
  def index
    @tickets = Ticket.paginate :page => params[:page], :conditions => search_conditions, :order => 'created_at DESC'

SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

INSERT INTO `tickets` (`name`, `created_at`, `body`, `urgent`, `updated_at`, `domain`, `username`, `subject`, `category_id`, `password`, `key`, `email`, `state`) VALUES('Erik Dungan', '2009-02-19 23:08:12', 'I updated my background image in my admin, but when I view my site, it will not update. What do I do? I\'m using IE 5.5', 0, '2009-02-19 23:08:12', 'somephotography.com', 'foo', 'My background image wont update', 1, 'bar', '8GHDIKU7', 'erik.dungan@gmail.com', 'fresh')
SELECT * FROM `tickets` WHERE (`tickets`.`key` = '8GHDIKU7') LIMIT 1
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if verify_recaptcha() && @ticket.save
        flash[:notice] = 'Ticket was successfully created.'
        format.html { redirect_to(view_by_key_url(@ticket.key)) }
        format.xml  { render :xml => @ticket, :status => :created, :location => @ticket }
        # Send a text message
        deliver_sms(@ticket.mobile_number.gsub(/[^0-9]/,""), @ticket.carrier_name, "Your support ticket has been received.") unless @ticket.mobile_number.blank?

SELECT * FROM `tickets` WHERE (state = 'fresh' OR state = 'researching')
---
  def fresh
    @tickets = Ticket.find(:all, :conditions => "state = 'fresh' OR state = 'researching'", :order => 'created_at DESC')