app/controllers/users_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` IN (1,2))
---
  def update
    @user = current_user
    @categories = Category.find(:all)

INSERT INTO `users` (`name`, `salt`, `created_at`, `avatar_file_name`, `avatar_file_size`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `avatar_uploaded_at`, `avatar_content_type`, `remember_token`, `login`, `avatar_updated_at`, `email`) VALUES('Ed Dungan', 'a01b4176f8bd0616a8c2011978626180200cea98', '2009-05-27 19:31:31', NULL, NULL, '2a1ed4ef9be7581dd1659ffad857b495918894b5', NULL, '2009-05-27 19:31:31', NULL, NULL, NULL, 'erik', NULL, 'erik.dungan@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save